consumir_middleware_exemplos/benchmark/resultados_nao_usados/testes_final/SQLStreamify.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Target transaction rate: 31/sec
Report intermediate results every 2 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 2s ] thds: 8 tps: 31.98 qps: 198.36 (r/w/o: 0.00/131.41/66.95) lat (ms,95%): 200.47 err/s: 1.00 reconn/s: 0.00
[ 2s ] queue length: 0, concurrency: 3
[ 4s ] thds: 8 tps: 32.00 qps: 191.52 (r/w/o: 0.00/128.01/63.51) lat (ms,95%): 118.92 err/s: 0.50 reconn/s: 0.00
[ 4s ] queue length: 0, concurrency: 1
[ 6s ] thds: 8 tps: 32.50 qps: 206.01 (r/w/o: 0.00/136.01/70.01) lat (ms,95%): 427.07 err/s: 5.00 reconn/s: 0.00
[ 6s ] queue length: 0, concurrency: 1
[ 8s ] thds: 8 tps: 30.00 qps: 180.99 (r/w/o: 0.00/120.50/60.50) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
[ 8s ] queue length: 0, concurrency: 2
[ 10s ] thds: 8 tps: 30.00 qps: 184.00 (r/w/o: 0.00/122.00/62.00) lat (ms,95%): 69.29 err/s: 1.00 reconn/s: 0.00
[ 10s ] queue length: 0, concurrency: 4
[ 12s ] thds: 8 tps: 33.00 qps: 222.50 (r/w/o: 0.00/147.00/75.50) lat (ms,95%): 502.20 err/s: 7.50 reconn/s: 0.00
[ 12s ] queue length: 0, concurrency: 8
[ 14s ] thds: 8 tps: 36.50 qps: 223.51 (r/w/o: 0.00/148.51/75.00) lat (ms,95%): 314.45 err/s: 4.50 reconn/s: 0.00
[ 14s ] queue length: 0, concurrency: 3
[ 16s ] thds: 8 tps: 27.00 qps: 156.48 (r/w/o: 0.00/103.99/52.49) lat (ms,95%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 16s ] queue length: 0, concurrency: 0
[ 18s ] thds: 8 tps: 34.00 qps: 220.01 (r/w/o: 0.00/145.01/75.01) lat (ms,95%): 223.34 err/s: 3.00 reconn/s: 0.00
[ 18s ] queue length: 0, concurrency: 8
[ 20s ] thds: 8 tps: 33.00 qps: 202.00 (r/w/o: 0.00/134.50/67.50) lat (ms,95%): 253.35 err/s: 2.50 reconn/s: 0.00
[ 20s ] queue length: 0, concurrency: 6
[ 22s ] thds: 8 tps: 31.50 qps: 190.00 (r/w/o: 0.00/127.50/62.50) lat (ms,95%): 314.45 err/s: 1.50 reconn/s: 0.00
[ 22s ] queue length: 0, concurrency: 2
[ 24s ] thds: 8 tps: 32.00 qps: 192.00 (r/w/o: 0.00/128.00/64.00) lat (ms,95%): 139.85 err/s: 0.00 reconn/s: 0.00
[ 24s ] queue length: 0, concurrency: 2
[ 26s ] thds: 8 tps: 34.00 qps: 212.00 (r/w/o: 0.00/138.50/73.50) lat (ms,95%): 308.84 err/s: 3.00 reconn/s: 0.00
[ 26s ] queue length: 0, concurrency: 7
[ 28s ] thds: 8 tps: 29.50 qps: 179.50 (r/w/o: 0.00/120.00/59.50) lat (ms,95%): 383.33 err/s: 3.00 reconn/s: 0.00
[ 28s ] queue length: 0, concurrency: 2
[ 30s ] thds: 8 tps: 27.50 qps: 170.99 (r/w/o: 0.00/114.49/56.50) lat (ms,95%): 90.78 err/s: 0.50 reconn/s: 0.00
[ 30s ] queue length: 0, concurrency: 4
[ 32s ] thds: 8 tps: 33.00 qps: 202.02 (r/w/o: 0.00/133.02/69.01) lat (ms,95%): 337.94 err/s: 3.50 reconn/s: 0.00
[ 32s ] queue length: 0, concurrency: 3
[ 34s ] thds: 8 tps: 35.00 qps: 208.99 (r/w/o: 0.00/138.99/70.00) lat (ms,95%): 125.52 err/s: 1.50 reconn/s: 0.00
[ 34s ] queue length: 0, concurrency: 0
[ 36s ] thds: 8 tps: 30.00 qps: 187.50 (r/w/o: 0.00/125.00/62.50) lat (ms,95%): 200.47 err/s: 0.50 reconn/s: 0.00
[ 36s ] queue length: 0, concurrency: 5
[ 38s ] thds: 8 tps: 32.50 qps: 190.49 (r/w/o: 0.00/126.49/64.00) lat (ms,95%): 193.38 err/s: 1.00 reconn/s: 0.00
[ 38s ] queue length: 0, concurrency: 0
[ 40s ] thds: 8 tps: 35.50 qps: 222.00 (r/w/o: 0.00/147.50/74.50) lat (ms,95%): 123.28 err/s: 2.00 reconn/s: 0.00
[ 40s ] queue length: 0, concurrency: 3
[ 42s ] thds: 8 tps: 25.00 qps: 159.50 (r/w/o: 0.00/106.50/53.00) lat (ms,95%): 211.60 err/s: 2.00 reconn/s: 0.00
[ 42s ] queue length: 0, concurrency: 5
[ 44s ] thds: 8 tps: 32.50 qps: 190.01 (r/w/o: 0.00/126.50/63.50) lat (ms,95%): 125.52 err/s: 0.50 reconn/s: 0.00
[ 44s ] queue length: 0, concurrency: 1
[ 46s ] thds: 8 tps: 30.50 qps: 187.00 (r/w/o: 0.00/124.50/62.50) lat (ms,95%): 253.35 err/s: 1.00 reconn/s: 0.00
[ 46s ] queue length: 0, concurrency: 2
[ 48s ] thds: 8 tps: 31.00 qps: 202.50 (r/w/o: 0.00/133.50/69.00) lat (ms,95%): 337.94 err/s: 4.00 reconn/s: 0.00
[ 48s ] queue length: 0, concurrency: 8
[ 50s ] thds: 8 tps: 29.00 qps: 169.00 (r/w/o: 0.00/113.50/55.50) lat (ms,95%): 356.70 err/s: 1.00 reconn/s: 0.00
[ 50s ] queue length: 0, concurrency: 1
[ 52s ] thds: 8 tps: 24.50 qps: 159.50 (r/w/o: 0.00/104.50/55.00) lat (ms,95%): 493.24 err/s: 2.50 reconn/s: 0.00
[ 52s ] queue length: 3, concurrency: 8
[ 54s ] thds: 8 tps: 28.50 qps: 184.50 (r/w/o: 0.00/121.50/63.00) lat (ms,95%): 977.74 err/s: 6.00 reconn/s: 0.00
[ 54s ] queue length: 14, concurrency: 8
[ 56s ] thds: 8 tps: 23.00 qps: 152.50 (r/w/o: 0.00/100.50/52.00) lat (ms,95%): 1453.01 err/s: 6.00 reconn/s: 0.00
[ 56s ] queue length: 38, concurrency: 8
[ 58s ] thds: 8 tps: 31.50 qps: 203.50 (r/w/o: 0.00/133.50/70.00) lat (ms,95%): 1803.47 err/s: 7.00 reconn/s: 0.00
[ 58s ] queue length: 21, concurrency: 8
[ 60s ] thds: 8 tps: 38.50 qps: 255.51 (r/w/o: 0.00/168.01/87.50) lat (ms,95%): 1304.21 err/s: 10.50 reconn/s: 0.00
[ 60s ] queue length: 4, concurrency: 8
[ 62s ] thds: 8 tps: 32.50 qps: 194.50 (r/w/o: 0.00/130.00/64.50) lat (ms,95%): 623.33 err/s: 3.00 reconn/s: 0.00
[ 62s ] queue length: 0, concurrency: 1
[ 64s ] thds: 8 tps: 29.00 qps: 173.00 (r/w/o: 0.00/115.00/58.00) lat (ms,95%): 82.96 err/s: 0.50 reconn/s: 0.00
[ 64s ] queue length: 0, concurrency: 0
[ 66s ] thds: 8 tps: 23.50 qps: 143.50 (r/w/o: 0.00/95.50/48.00) lat (ms,95%): 164.45 err/s: 1.00 reconn/s: 0.00
[ 66s ] queue length: 0, concurrency: 0
[ 68s ] thds: 8 tps: 29.00 qps: 179.97 (r/w/o: 0.00/120.48/59.49) lat (ms,95%): 97.55 err/s: 0.00 reconn/s: 0.00
[ 68s ] queue length: 0, concurrency: 2
[ 70s ] thds: 8 tps: 30.00 qps: 195.00 (r/w/o: 0.00/127.50/67.50) lat (ms,95%): 520.62 err/s: 4.50 reconn/s: 0.00
[ 70s ] queue length: 1, concurrency: 8
[ 72s ] thds: 8 tps: 30.50 qps: 178.53 (r/w/o: 0.00/119.02/59.51) lat (ms,95%): 419.45 err/s: 2.50 reconn/s: 0.00
[ 72s ] queue length: 0, concurrency: 0
[ 74s ] thds: 8 tps: 26.50 qps: 160.50 (r/w/o: 0.00/107.00/53.50) lat (ms,95%): 153.02 err/s: 0.50 reconn/s: 0.00
[ 74s ] queue length: 0, concurrency: 0
[ 76s ] thds: 8 tps: 33.00 qps: 209.00 (r/w/o: 0.00/138.00/71.00) lat (ms,95%): 207.82 err/s: 2.00 reconn/s: 0.00
[ 76s ] queue length: 0, concurrency: 6
[ 78s ] thds: 8 tps: 29.50 qps: 178.00 (r/w/o: 0.00/119.50/58.50) lat (ms,95%): 200.47 err/s: 2.00 reconn/s: 0.00
[ 78s ] queue length: 0, concurrency: 1
[ 80s ] thds: 8 tps: 31.00 qps: 195.01 (r/w/o: 0.00/128.50/66.50) lat (ms,95%): 193.38 err/s: 2.00 reconn/s: 0.00
[ 80s ] queue length: 0, concurrency: 5
[ 82s ] thds: 8 tps: 29.00 qps: 172.49 (r/w/o: 0.00/113.49/59.00) lat (ms,95%): 244.38 err/s: 1.50 reconn/s: 0.00
[ 82s ] queue length: 0, concurrency: 5
[ 84s ] thds: 8 tps: 34.50 qps: 225.51 (r/w/o: 0.00/149.50/76.00) lat (ms,95%): 314.45 err/s: 5.00 reconn/s: 0.00
[ 84s ] queue length: 0, concurrency: 8
[ 86s ] thds: 8 tps: 32.00 qps: 204.51 (r/w/o: 0.00/135.50/69.00) lat (ms,95%): 530.08 err/s: 6.00 reconn/s: 0.00
[ 86s ] queue length: 0, concurrency: 6
[ 88s ] thds: 8 tps: 24.00 qps: 138.50 (r/w/o: 0.00/92.50/46.00) lat (ms,95%): 303.33 err/s: 0.50 reconn/s: 0.00
[ 88s ] queue length: 0, concurrency: 1
[ 90s ] thds: 8 tps: 27.50 qps: 178.00 (r/w/o: 0.00/119.00/59.00) lat (ms,95%): 196.89 err/s: 1.50 reconn/s: 0.00
[ 90s ] queue length: 0, concurrency: 6
[ 92s ] thds: 8 tps: 38.50 qps: 226.50 (r/w/o: 0.00/151.00/75.50) lat (ms,95%): 183.21 err/s: 1.00 reconn/s: 0.00
[ 92s ] queue length: 0, concurrency: 1
[ 94s ] thds: 8 tps: 28.00 qps: 176.50 (r/w/o: 0.00/117.50/59.00) lat (ms,95%): 153.02 err/s: 1.00 reconn/s: 0.00
[ 94s ] queue length: 0, concurrency: 5
[ 96s ] thds: 8 tps: 32.50 qps: 215.48 (r/w/o: 0.00/141.49/73.99) lat (ms,95%): 580.02 err/s: 7.50 reconn/s: 0.00
[ 96s ] queue length: 2, concurrency: 8
[ 98s ] thds: 8 tps: 30.00 qps: 181.00 (r/w/o: 0.00/119.50/61.50) lat (ms,95%): 493.24 err/s: 1.50 reconn/s: 0.00
[ 98s ] queue length: 3, concurrency: 8
[ 100s ] thds: 8 tps: 26.00 qps: 159.99 (r/w/o: 0.00/105.99/54.00) lat (ms,95%): 995.51 err/s: 2.00 reconn/s: 0.00
[ 100s ] queue length: 18, concurrency: 8
[ 102s ] thds: 8 tps: 25.50 qps: 169.52 (r/w/o: 0.00/112.52/57.01) lat (ms,95%): 1327.91 err/s: 6.00 reconn/s: 0.00
[ 102s ] queue length: 25, concurrency: 8
[ 104s ] thds: 8 tps: 26.50 qps: 164.01 (r/w/o: 0.00/107.00/57.00) lat (ms,95%): 1678.14 err/s: 4.00 reconn/s: 0.00
[ 104s ] queue length: 12, concurrency: 8
[ 106s ] thds: 8 tps: 21.50 qps: 142.00 (r/w/o: 0.00/93.50/48.50) lat (ms,95%): 1506.29 err/s: 5.50 reconn/s: 0.00
[ 106s ] queue length: 40, concurrency: 8
[ 108s ] thds: 8 tps: 36.00 qps: 249.49 (r/w/o: 0.00/163.00/86.50) lat (ms,95%): 1589.90 err/s: 14.00 reconn/s: 0.00
[ 108s ] queue length: 19, concurrency: 8
[ 110s ] thds: 8 tps: 37.50 qps: 238.50 (r/w/o: 0.00/157.50/81.00) lat (ms,95%): 1089.30 err/s: 6.00 reconn/s: 0.00
[ 110s ] queue length: 1, concurrency: 8
[ 112s ] thds: 8 tps: 30.00 qps: 177.50 (r/w/o: 0.00/119.50/58.00) lat (ms,95%): 297.92 err/s: 1.00 reconn/s: 0.00
[ 112s ] queue length: 0, concurrency: 2
[ 114s ] thds: 8 tps: 33.50 qps: 201.00 (r/w/o: 0.00/133.50/67.50) lat (ms,95%): 116.80 err/s: 1.00 reconn/s: 0.00
[ 114s ] queue length: 0, concurrency: 1
[ 116s ] thds: 8 tps: 31.99 qps: 228.43 (r/w/o: 0.00/148.46/79.98) lat (ms,95%): 559.50 err/s: 12.50 reconn/s: 0.00
[ 116s ] queue length: 6, concurrency: 8
[ 118s ] thds: 8 tps: 35.00 qps: 215.02 (r/w/o: 0.00/143.02/72.01) lat (ms,95%): 419.45 err/s: 5.00 reconn/s: 0.00
[ 118s ] queue length: 0, concurrency: 2
[ 120s ] thds: 8 tps: 27.50 qps: 177.49 (r/w/o: 0.00/115.99/61.50) lat (ms,95%): 569.67 err/s: 3.50 reconn/s: 0.00
[ 120s ] queue length: 19, concurrency: 8
[ 122s ] thds: 8 tps: 24.01 qps: 158.04 (r/w/o: 0.00/104.03/54.01) lat (ms,95%): 1401.61 err/s: 6.00 reconn/s: 0.00
[ 122s ] queue length: 36, concurrency: 8
[ 124s ] thds: 8 tps: 25.00 qps: 166.47 (r/w/o: 0.00/109.48/56.99) lat (ms,95%): 1836.24 err/s: 6.50 reconn/s: 0.00
[ 124s ] queue length: 55, concurrency: 8
[ 126s ] thds: 8 tps: 25.50 qps: 162.53 (r/w/o: 0.00/107.02/55.51) lat (ms,95%): 2539.17 err/s: 4.50 reconn/s: 0.00
[ 126s ] queue length: 77, concurrency: 8
[ 128s ] thds: 8 tps: 24.50 qps: 159.00 (r/w/o: 0.00/104.00/55.00) lat (ms,95%): 3040.14 err/s: 6.00 reconn/s: 0.00
[ 128s ] queue length: 93, concurrency: 8
[ 130s ] thds: 8 tps: 22.50 qps: 151.50 (r/w/o: 0.00/101.00/50.50) lat (ms,95%): 3706.08 err/s: 5.50 reconn/s: 0.00
[ 130s ] queue length: 124, concurrency: 8
[ 132s ] thds: 8 tps: 25.50 qps: 165.00 (r/w/o: 0.00/108.00/57.00) lat (ms,95%): 4055.23 err/s: 6.00 reconn/s: 0.00
[ 132s ] queue length: 123, concurrency: 8
[ 134s ] thds: 8 tps: 29.50 qps: 209.99 (r/w/o: 0.00/138.49/71.50) lat (ms,95%): 4855.31 err/s: 12.50 reconn/s: 0.00
[ 134s ] queue length: 129, concurrency: 8
[ 136s ] thds: 8 tps: 34.00 qps: 216.02 (r/w/o: 0.00/142.51/73.51) lat (ms,95%): 4855.31 err/s: 5.50 reconn/s: 0.00
[ 136s ] queue length: 125, concurrency: 8
[ 138s ] thds: 8 tps: 28.99 qps: 189.97 (r/w/o: 0.00/124.48/65.49) lat (ms,95%): 4517.90 err/s: 7.50 reconn/s: 0.00
[ 138s ] queue length: 126, concurrency: 8
[ 140s ] thds: 8 tps: 31.00 qps: 203.53 (r/w/o: 0.00/135.02/68.51) lat (ms,95%): 4599.99 err/s: 6.50 reconn/s: 0.00
[ 140s ] queue length: 124, concurrency: 8
[ 142s ] thds: 8 tps: 35.50 qps: 234.00 (r/w/o: 0.00/154.00/80.00) lat (ms,95%): 4599.99 err/s: 9.00 reconn/s: 0.00
[ 142s ] queue length: 116, concurrency: 8
[ 144s ] thds: 8 tps: 35.00 qps: 222.49 (r/w/o: 0.00/146.49/76.00) lat (ms,95%): 4203.93 err/s: 6.00 reconn/s: 0.00
[ 144s ] queue length: 111, concurrency: 8
[ 146s ] thds: 8 tps: 32.50 qps: 206.51 (r/w/o: 0.00/137.01/69.50) lat (ms,95%): 4055.23 err/s: 4.50 reconn/s: 0.00
[ 146s ] queue length: 110, concurrency: 8
[ 148s ] thds: 8 tps: 37.50 qps: 233.99 (r/w/o: 0.00/154.00/80.00) lat (ms,95%): 3773.42 err/s: 5.00 reconn/s: 0.00
[ 148s ] queue length: 86, concurrency: 8
[ 150s ] thds: 8 tps: 33.00 qps: 223.01 (r/w/o: 0.00/146.51/76.50) lat (ms,95%): 3448.53 err/s: 10.50 reconn/s: 0.00
[ 150s ] queue length: 93, concurrency: 8
[ 152s ] thds: 8 tps: 30.50 qps: 206.50 (r/w/o: 0.00/137.50/69.00) lat (ms,95%): 3386.99 err/s: 8.00 reconn/s: 0.00
[ 152s ] queue length: 95, concurrency: 8
[ 154s ] thds: 8 tps: 32.00 qps: 209.00 (r/w/o: 0.00/135.50/73.50) lat (ms,95%): 3386.99 err/s: 9.50 reconn/s: 0.00
[ 154s ] queue length: 94, concurrency: 8
[ 156s ] thds: 8 tps: 32.00 qps: 210.98 (r/w/o: 0.00/139.99/70.99) lat (ms,95%): 3511.19 err/s: 6.50 reconn/s: 0.00
[ 156s ] queue length: 110, concurrency: 8
[ 158s ] thds: 8 tps: 32.00 qps: 226.51 (r/w/o: 0.00/148.50/78.00) lat (ms,95%): 3574.99 err/s: 14.00 reconn/s: 0.00
[ 158s ] queue length: 107, concurrency: 8
[ 160s ] thds: 8 tps: 33.00 qps: 212.49 (r/w/o: 0.00/138.99/73.50) lat (ms,95%): 3773.42 err/s: 7.50 reconn/s: 0.00
[ 160s ] queue length: 97, concurrency: 8
[ 162s ] thds: 8 tps: 34.50 qps: 221.51 (r/w/o: 0.00/146.51/75.00) lat (ms,95%): 3911.79 err/s: 6.00 reconn/s: 0.00
[ 162s ] queue length: 86, concurrency: 8
[ 164s ] thds: 8 tps: 32.00 qps: 212.50 (r/w/o: 0.00/140.00/72.50) lat (ms,95%): 3448.53 err/s: 8.50 reconn/s: 0.00
[ 164s ] queue length: 89, concurrency: 8
[ 166s ] thds: 8 tps: 32.00 qps: 206.50 (r/w/o: 0.00/135.00/71.50) lat (ms,95%): 3386.99 err/s: 7.50 reconn/s: 0.00
[ 166s ] queue length: 89, concurrency: 8
[ 168s ] thds: 8 tps: 30.50 qps: 210.01 (r/w/o: 0.00/139.01/71.00) lat (ms,95%): 3386.99 err/s: 10.00 reconn/s: 0.00
[ 168s ] queue length: 84, concurrency: 8
[ 170s ] thds: 8 tps: 33.50 qps: 220.00 (r/w/o: 0.00/144.00/76.00) lat (ms,95%): 3267.19 err/s: 9.00 reconn/s: 0.00
[ 170s ] queue length: 80, concurrency: 8
[ 172s ] thds: 8 tps: 31.50 qps: 208.49 (r/w/o: 0.00/137.49/71.00) lat (ms,95%): 3208.88 err/s: 7.50 reconn/s: 0.00
[ 172s ] queue length: 77, concurrency: 8
[ 174s ] thds: 8 tps: 33.00 qps: 215.00 (r/w/o: 0.00/143.00/72.00) lat (ms,95%): 2828.87 err/s: 6.00 reconn/s: 0.00
[ 174s ] queue length: 72, concurrency: 8
[ 176s ] thds: 8 tps: 32.50 qps: 203.01 (r/w/o: 0.00/134.00/69.00) lat (ms,95%): 2985.89 err/s: 4.00 reconn/s: 0.00
[ 176s ] queue length: 60, concurrency: 8
[ 178s ] thds: 8 tps: 35.00 qps: 219.51 (r/w/o: 0.00/144.50/75.00) lat (ms,95%): 2728.81 err/s: 5.00 reconn/s: 0.00
[ 178s ] queue length: 41, concurrency: 8
[ 180s ] thds: 8 tps: 30.50 qps: 210.49 (r/w/o: 0.00/137.99/72.50) lat (ms,95%): 2082.91 err/s: 11.50 reconn/s: 0.00
[ 180s ] queue length: 41, concurrency: 8
[ 182s ] thds: 8 tps: 34.00 qps: 218.50 (r/w/o: 0.00/144.00/74.50) lat (ms,95%): 2009.23 err/s: 6.50 reconn/s: 0.00
[ 182s ] queue length: 40, concurrency: 8
[ 184s ] thds: 8 tps: 33.00 qps: 214.01 (r/w/o: 0.00/141.01/73.00) lat (ms,95%): 1739.68 err/s: 7.00 reconn/s: 0.00
[ 184s ] queue length: 25, concurrency: 8
[ 186s ] thds: 8 tps: 31.00 qps: 202.49 (r/w/o: 0.00/132.99/69.50) lat (ms,95%): 1427.08 err/s: 7.50 reconn/s: 0.00
[ 186s ] queue length: 42, concurrency: 8
[ 188s ] thds: 8 tps: 30.00 qps: 204.01 (r/w/o: 0.00/134.01/70.00) lat (ms,95%): 1561.52 err/s: 10.00 reconn/s: 0.00
[ 188s ] queue length: 41, concurrency: 8
[ 190s ] thds: 8 tps: 35.99 qps: 228.46 (r/w/o: 0.00/149.47/78.99) lat (ms,95%): 1739.68 err/s: 6.50 reconn/s: 0.00
[ 190s ] queue length: 25, concurrency: 8
[ 192s ] thds: 8 tps: 31.00 qps: 212.01 (r/w/o: 0.00/138.51/73.50) lat (ms,95%): 1618.78 err/s: 11.50 reconn/s: 0.00
[ 192s ] queue length: 30, concurrency: 8
[ 194s ] thds: 8 tps: 34.50 qps: 236.03 (r/w/o: 0.00/155.02/81.01) lat (ms,95%): 1376.60 err/s: 11.50 reconn/s: 0.00
[ 194s ] queue length: 23, concurrency: 8
[ 196s ] thds: 8 tps: 30.49 qps: 204.44 (r/w/o: 0.00/133.96/70.48) lat (ms,95%): 1235.62 err/s: 9.50 reconn/s: 0.00
[ 196s ] queue length: 26, concurrency: 8
[ 198s ] thds: 8 tps: 31.00 qps: 214.02 (r/w/o: 0.00/141.51/72.51) lat (ms,95%): 1304.21 err/s: 10.50 reconn/s: 0.00
[ 198s ] queue length: 23, concurrency: 8
[ 200s ] thds: 8 tps: 33.01 qps: 216.55 (r/w/o: 0.00/142.03/74.52) lat (ms,95%): 1280.93 err/s: 8.50 reconn/s: 0.00
[ 200s ] queue length: 13, concurrency: 8
SQL statistics:
    queries performed:
        read:                            0
        write:                           26052
        other:                           13373
        total:                           39425
    transactions:                        6185   (30.86 per sec.)
    queries:                             39425  (196.74 per sec.)
    ignored errors:                      994    (4.96 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          200.3920s
    total number of events:              6185

Latency (ms):
         min:                                   21.95
         avg:                                 1230.72
         max:                                 4988.45
         95th percentile:                     4055.23
         sum:                              7612023.25

Threads fairness:
    events (avg/stddev):           773.1250/14.81
    execution time (avg/stddev):   951.5029/25.84